#include <iostream>
#include <iomanip>
using namespace std;
class Student //Student类声明
{
public:
    Student(float c, float m, float e)
    {
        //在两条星线间填入代码，补充完成学生类Student的构造函数定义, 把
        //数据成员chinese、math和english分别初始化为参数c,m,e的值
        /*************************************************************/
        chinese = c;
        math = m;
        english = e;
        /*************************************************************/
    }
    void sum()
    {
        //在两条星线间填入代码，补充完成成员函数sum的定义，求Student对
        //象的总分并输出到屏幕上
        /************************************************************/
        float sum;
        sum = chinese + math + english;
        cout << "总分:" << sum << endl;
        /************************************************************/
    }
    void average();

private:
    //在两条星线间填入代码，定义私有数据成员chinese、math和english，分
    //别用于表示语文、数学和英语的成绩,它们都是float型的数据
    /****************************************************************/
    float chinese, math, english;
    /****************************************************************/
};
//在两条星线间填入代码，完成成员函数average的类外定义，求Student对象的
//平均分并输出到屏幕上
/********************************************************************/
void Student::average()
{
    float avg;
    avg = (chinese + math + english) / 3;
    cout << "平均分:" << avg << endl;
}
/********************************************************************/
int main() //主函数
{
    Student stud(65.3, 78, 90); //定义对象stud
    //在两条星线间填入代码，完成向对象stud分别发送sum消息和average消息
    /********************************************************************/
    stud.sum();     //向对象发消息sum
    stud.average(); //向对象stud发消息average
                    /********************************************************************/
    return 0;
}