#include <iostream>
#include <iomanip>
using namespace std; /* 打开标准名字空间 */
int main()
{
    double p, r, c, s;
    cout << "请输入圆的半径：";
    cin >> r;
    cout << "请输入圆周率：";
    //请在两条星线间填入代码，输入圆周率，并计算周长和面积
    /******************************************************/
    cin >> p;
    c = 2 * p * r;
    s = p * r * r;
    /******************************************************/
    cout << "圆周长=" << setw(8) << c << endl; //设置域宽为8
    //请在两条星线间填入代码，输出面积，设置域宽为8、精度为6
    /******************************************************/
    cout << "圆面积=" << setw(8) << setprecision(8) << s << endl;
    /******************************************************/
    return 0;
}